# -*- coding: utf-8 -*-

text = "'ปรับโปรแกรมการทำงานตามเนื้อผ้าที่ซัก', 'สูงมาก', 'แห้งพร้อมสวมใส่', 'ผ้าครึ่งถังจะใช้เวลาซักประมาณ 39 นาที', 'ทำความสะอาด เครื่องจ่ายน้ำยา 2 หากยังคงมีข้อผิดพลาดอยู่ ให้โทรติดต่อเพื่อขอรับบริการ', 'เชื่อมต่อกับแอป LG ThinQ เพิ่มเริ่มการซักผ้าที่เหมาะสำหรับคุณ', 'เครื่องจ่ายน้ำยา 1', 'ออกแบบมาเพื่อทำความสะอาดภายในของเครื่องซักผ้า', 'มากกว่า', 'ทำความสะอาด เครื่องจ่ายน้ำยา 2 ด้วยระบบ ezDispense ก่อนเติมของน้ำยาซักผ้าใหม่', 'ปิด', 'ปั่นเบา', 'เซนเซอร์วัดระดับน้ำทำงานผิดปกติ ให้โทรติดต่อเพื่อขอรับบริการ', 'เหลือน้ำยาซักผ้าอยู่น้อย เติมน้ำยาซักผ้า', 'ปั่นหมาด', 'ปิด', 'ปิด', 'สูง', 'อบแห้ง', 'ทำความสะอาด เครื่องจ่ายน้ำยา 1 หากยังคงมีข้อผิดพลาดอยู่ ให้โทรติดต่อเพื่อขอรับบริการ', 'สิ้นสุดการซัก', 'ทำความสะอาด เครื่องจ่ายน้ำยา 1 เติมน้ำและเริ่มการทำงานของ ทำความสะอาดระบบ ezDispense เครื่องจะดับลงเมื่อสิ้นสุดการทำความสะอาด โปรดดูคู่มือผู้ใช้', 'การจ่ายน้ำยาปรับผ้านุ่มอัตโนมัติ', 'ปิด', 'ข้อผิดพลาดที่เครื่องจ่ายน้ำยา 2', 'สิ้นสุดการอบแห้ง', 'ตรวจสอบถังใส่น้ำยาซักผ้า', '40°C', 'ช่วยล้างคราบอาหารจากเสื้อผ้าของทารกด้วยการใช้ไอน้ำ', 'หยุดชั่วคราว', '2 ครั้ง', 'ผ้าที่ไม่ต้องรีด', 'ก่อนการซัก', 'เปิดและปิดประตูให้สนิท', 'ล้างและปั่นหมาดผ้าเท่านั้น', 'เหลือน้ำยาในเครื่องจ่ายยาอยู่น้อย เติมเครื่องจ่ายน้ำยาทั้งสอง', '9 ~120 มล. (3 มล.)', 'มีข้อความส่งไปที่แอป LG ThinQ โปรดตรวจสอบโทรศัพท์ของคุณ', 'ผ้าปูที่นอน', 'ปานกลาง', 'ผ้าที่ใส่ไว้ไม่สมดุล ตรวจสอบให้แน่ใจผ้าไม่พันกันหรือแยกส่วนออกจากกัน', 'เริ่มต้นการตั้งค่าทั้งหมดให้กลับไปที่ค่าเริ่มต้นจากโรงงาน ต้องการรีเซ็ตการตั้งค่าทั้งหมดหรือไม่', 'การทำความสะอาด', 'เครื่องนอน เช่น ผ้าปูที่นอน', 'ข้อผิดพลาดที่การเชื่อมต่อ Wi-Fi ให้ตรวจสอบข้อมูลในแอป LG ThinQ แล้วลองอีกครั้ง', 'น้ำยาซักผ้าที่ 2', 'ระดับน้ำสูงเกินไป ให้ปิดก๊อกน้ำและโทรติดต่อเพื่อขอรับบริการ', 'เครื่องนอน', 'ป้องกันเด็ก', 'ปิด', 'ผ้าขนสัตว์ที่หดได้ หรือผ้าที่ต้องซักด้วยมือ', 'หมุนแป้นหมุนเพื่อเลือกเวลาสิ้นสุด และแตะ ✓ เพื่อตั้งค่า', 'สิ้นสุด ล้างถังซัก', 'ข้อผิดพลาดของท่อส่งน้ำ', '3 ครั้ง', 'ข้อผิดพลาดของการระบายน้ำ', 'สำหรับซักผ้าสี', 'การล้าง', 'ปิด', 'ถือไมโครโฟนไว้ใกล้ ๆ กับปุ่ม เปิด/ปิด แล้วกดปุ่มเริ่มต้น', 'การปิด ป้องกันเด็ก', 'กด ✓ เพื่อทำความสะอาด', 'เชื่อมต่อ Wi-Fi แล้ว', 'เปิด', 'ปกติ', 'นำผ้าที่ใส่ไว้บางส่วนออก และเริ่มการซักอีกครั้ง หากยังคงแสดงข้อผิดพลาดอยู่ ให้โทรติดต่อเพื่อขอรับบริการ', '120 นาที', 'ฟังก์ชันการจ่ายน้ำยาซักผ้าทำงานผิดปกติ ให้โทรติดต่อเพื่อขอรับบริการ', 'อบแห้ง ', 'ขั้นต่ำ', 'ปริมาณน้ำยาปรับผ้านุ่ม'"
# 문자열을 쉼표(,)로 분리하여 리스트로 만듭니다
print(f'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!type(text) : {type(text)}')

items = text.split(', ')

# # 리스트의 각 항목을 루프를 통해 출력합니다
# for item in items:
#     print(item)

# 리스트의 길이, 즉 항목의 개수 출력
print(f'총 {len(items)}개의 항목이 있습니다.')
# 파일 경로
file_path = "C:\\Users\\TAMSystech\\yjh\\text_file\\전체 언어 텍스트 파일\\태국어.txt"

# 파일을 읽고, 라인별로 처리
# with open(file_path, 'r', encoding='utf-8') as file:
#     #search_string = "'ปรับโปรแกรมการทำงานตามเนื้อผ้าที่ซัก'"  # 찾고자 하는 문자열
#
#     line_count = 0  # 찾고자 하는 문자열이 나타난 라인 수
#
#     lines = file.readlines()
#     print(f'lines  : {lines}')
#     for line in lines:
#         # 각 라인 출력
#         print(f'라인 {line_count}: {line.strip()}')
#
#         for item in items:
#             search_string = item.strip()
#             print(f'있음!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!search_string : {search_string}')
#             print(f'있음!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!line : {line}')
#             if search_string in line:
#                 line_count += 1
#                 print(f'있음!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!line_count : {line_count}')
#
#                 print(f"'{search_string}'가 {line_count}개의 라인에서 발견되었습니다.")

# 파일 경로
file_path = "C:/Users/TAMSystech/yjh/text_file/전체 언어 텍스트 파일/태국어.txt"

# 파일을 라인별로 읽어서 출력
# with open(file_path, 'r', encoding='utf-8') as file:
#     for line in file:
#         #print(line.strip())  # 각 라인 출력, strip()로 공백 및 개행 문자 제거
#         print(f'!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!line.strip() : {line.strip()}')
#

# 파일 경로
file_path = "C:/Users/TAMSystech/yjh/text_file/전체 언어 텍스트 파일/태국어.txt"

# 파일을 라인별로 읽어서 출력
with open(file_path, 'r', encoding='utf-8') as file:
    # items 리스트 초기화
    #items = ["'ปรับโปรแกรมการทำงานตามเนื้อผ้าที่ซัก'", '...', '모든 항목 추가']

    for line in file:
        for item in items:
            if item in line:
                print(f"라인에 {item}이(가) 포함되어 있습니다.")
